[
    {
        "id": 1,
        "photo": "assets/images/blog/personal-loan.jpg",
        "postdate": "25 January , 2021",
        "title": "Do's and Dont's for getting a Personal Loan",
        "shortdesc": "One of the simplest and easiest ways to handle cash crunches is by taking a Personal Loan. Considering the features...",
        "author": {
            "authorphoto": "assets/images/doctors/doctor13.jpg",
            "authorname": "Charles C. Pruitt"
        },
        "longdescription": "<p className='text-custom-black'>One of the simplest and easiest ways to handle cash crunches is by taking a Personal Loan. Considering the features of the loan, simple eligibility criteria and minimal documentation Personal Loan is the preferred choice for many people seeking a loan today. There is no restriction on the purpose of the loan, it could be for anything ranging from funding a family function to medical emergencies to child’s education, a personal loan can be availed for anything.</p><p className='text-custom-black'>Also the fact that processing of a Personal Loan is hassle free and takes minimal time for the loan to be approved and disbursed makes it a more preferred choice for people. One can also apply for a personal loan online from the comfort of their home and get the loan disbursed within a few hours.</p><p className='text-custom-black'>Now that we have determined that a Personal Loan is a one stop solution for a financial need, it is imperative to understand and be aware of the factors that needs to be taken into consideration before going for a Personal Loan in order to make sure that there is no major impact on an individual’s finances and will not lead to any future crisis. For example, in the urgency of getting funds, many people ignore the interest rate factor. This impacts borrower’s future finances and can also lead to trouble if they are unable to pay the EMIs.</p><h5 className='text-custom-black fw-600'>Let us go through a few of the Do’s and Don’t’s that can guide us through the Personal Loan process:</h5><h5 className='text-custom-black fw-600'>Do’s:</h5><h5 className='text-custom-black fw-600'>Comparing the interest rate is a must</h5><p className='text-custom-black'>There are various Banks and NBFCs that offer you a Personal Loan and it is quite obvious that there would be difference in the terms and interest rates. Hence it is important to know and compare the interest rates with different lenders. This helps in getting the best offer at affordable pricing. </p><h5 className='text-custom-black fw-600'>Determine the loan amount you require</h5><p className='text-custom-black'>Firstly you need to determine the exact loan amount you require for your need and it is wise to only avail only as much as required. There may be possibilities that you are eligible for a higher amount considering your profile but you need not avail more if you do not need it. And thereby avoid paying an extra interest amount.</p><h5 className='text-custom-black fw-600'>Compare for offerings with additional features and benefit</h5><p className='text-custom-black'>While it is important to compare the interest rates, it is equally important to compare the loan offerings such as the loan amount, tenure along with the interest rates from various banks. Then finalize one based on the best offering and availability of additional features/offers. These can help you to reduce the cost of borrowing, or even help you get the money you need on flexible terms.</p><h5 className='text-custom-black fw-600'>Check eligibility criteria with different banks/NBFCs</h5><p className='text-custom-black'>It is equally important to check for the eligibility criteria of the different banks. This helps us know which bank fits best for us as per our eligibility and thereby you are ensuring that the chances of loan rejection is minimal to no.</p><h5 className='text-custom-black fw-600'>Don’ts:</h5><h5 className='text-custom-black fw-600'>Don’t accept the first loan offer you get</h5><p className='text-custom-black'>There could be various loan offers being offered to you but this should not be a trigger for you to go with the fist offer you get. Even after you have got the offer, it is important that you check with other lenders and their offers and then decide on which one suits you the best in terms of your requirement and financial situation.</p><h5 className='text-custom-black fw-600'>Don’t take out the maximum loan possible</h5><p className='text-custom-black'>Your Bank/Advisor might suggest you go for a full loan amount for which you are eligible. But, it is not recommended that you take out a big loan just because you are eligible for it. Personal loans are loans with high interest rates and hence one needs to be careful before going for a particular loan amount. However, it is important to analyse your repayment capacity before you apply for a personal loan. Apply as per your requirement and repayment capability.</p><h5 className='text-custom-black fw-600'>Do not make several loan applications at once</h5><p className='text-custom-black'>Often when someone is in an urgent need for money might end up applying for the loan with multiple banks at the same time. One must know and remember that by doing this you are hampering your credit score, because each time you apply for a loan, there is a credit check and that results in a reduced credit score to some extent. These checks could hurt your CIBIL score, lowering your loan eligibility and credibility both.</p><p className='text-custom-black'>A personal loan certainly helps deal with several financial crises. Keeping the above discussed pointers in mind when availing a Personal Loan could certainly be a saverfrom future problems.</p>"
    }
]